docs/blog/mwu/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-29 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MWU</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="/favicon.ico"> <link rel="stylesheet" href="/style.css" />

</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <a href="/"><div class="navitem home">&heartsuit;</div></a>
    <a href="/pubs"><div class="navitem">pubs</div></a>
    <a href="/blog"><div class="navitem">blog</div></a>
    <a href="/meta"><div class="navitem">meta</div></a>
    <a href="/files/Sricharan_AR_CV.pdf"><div class="navitem">cv</div></a>
</div> <hr>
</div>
<div id="content" class="content">
<p>
The Multiplicative Weights Update algorithm! It&rsquo;s extremely useful, I&rsquo;ve used it, and I don&rsquo;t &ldquo;get&rdquo; it. If I see one more writeup that motivates the algorithm using expert predictions I&rsquo;m gonna flip my shit. I&rsquo;m not a (terminally) online person, and while I understand that it&rsquo;s useful in the online setting, I. Don&rsquo;t. Care. Writing up something about it is how I hope to finally understand this goddamn algorithm. There&rsquo;s way too many ways of seeing \cite{John Berger} that I have read up on, and I have too many things in my mind. I need to offload some of it.
</p>

<div id="outline-container-org2183985" class="outline-2">
<h2 id="org2183985">View 1: Solve LPs approximately</h2>
<div class="outline-text-2" id="text-org2183985">
<p>
This is the most useful/least intuitive view for me. It&rsquo;s great that it solves LPs. How does it do it? You want to find an \(x\) such that \(Ax \le b\). What you can actually do is solve \(p^t A x \le p^t b\) for any probability distribution \(p\). Great, keep solving such inequalities for different \(p\). This is MWU. After a while, the average of all previous solutions is an approximate solution, \(A\overline x \le b + \epsilon\).
</p>
</div>
</div>
</div>
</body>
</html>